In [1]:
import numpy as np

In [12]:
import pandas as pd

In [14]:
population_dict={'california':235356564,
                'texas':4565554444,
                'new york':12333333,
                'florida':45556666,
                'illions':1255555}

In [15]:
population=pd.Series(population_dict)
population

california     235356564
florida         45556666
illions          1255555
new york        12333333
texas         4565554444
dtype: int64

In [16]:
area={'california':1,'texis':2,'new york':3,'forida':4,'illinois':5}

In [17]:
area

{'california': 1, 'forida': 4, 'illinois': 5, 'new york': 3, 'texis': 2}

In [18]:
pd.Series(area)

california    1
forida        4
illinois      5
new york      3
texis         2
dtype: int64

In [24]:
states=pd.DataFrame({'population':population,'area':area})
states

            area    population
california   1.0  2.353566e+08
florida      NaN  4.555667e+07
forida       4.0           NaN
illinois     5.0           NaN
illions      NaN  1.255555e+06
new york     3.0  1.233333e+07
texas        NaN  4.565554e+09
texis        2.0           NaN

In [26]:
states.index

Index(['california', 'florida', 'forida', 'illinois', 'illions', 'new york',
       'texas', 'texis'],
      dtype='object')

In [27]:
states.columns

Index(['area', 'population'], dtype='object')

In [37]:
states['area']#dataframe只能通过列属性索引一个series。不能索引行属性。即column相当于键。

california    1.0
florida       NaN
forida        4.0
illinois      5.0
illions       NaN
new york      3.0
texas         NaN
texis         2.0
Name: area, dtype: float64

创建dataframe对象

In [35]:
#通过series来创建。dataframe是一组series集合。可以使用单个series创建单列的dataframe

In [36]:
pd.DataFrame(population,columns=['population'])

            population
california   235356564
florida       45556666
illions        1255555
new york      12333333
texas       4565554444

In [38]:
#通过由字典组成的列表来创建。

In [40]:
data=[{'a':i,'b':i**2} for i in range(3)]
data

[{'a': 0, 'b': 0}, {'a': 1, 'b': 1}, {'a': 2, 'b': 4}]

In [43]:
pd.DataFrame(data)#原来字典的键，变成了列标签。行标签自动添加为证书序列

   a  b
0  0  0
1  1  1
2  2  4

In [46]:
pd.DataFrame([{'a':1,'b':2},{'b':3,'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [49]:
#使用series对象创建dataframe。

states=pd.DataFrame({'population':population,'area':area})
states

            area    population
california   1.0  2.353566e+08
florida      NaN  4.555667e+07
forida       4.0           NaN
illinois     5.0           NaN
illions      NaN  1.255555e+06
new york     3.0  1.233333e+07
texas        NaN  4.565554e+09
texis        2.0           NaN

In [50]:
#使用numpy二维数组创建。

In [55]:
pd.DataFrame(np.random.rand(3,2),columns=['foo','bar'],index=['a','b','c'])
#如果不通过columns和index指定行列标签。则二者都默认为整数序列

        foo       bar
a  0.448751  0.554244
b  0.244636  0.176513
c  0.306230  0.072842

In [57]:
pd.DataFrame(np.random.rand(3,2))

          0         1
0  0.419218  0.700436
1  0.904445  0.864991
2  0.820709  0.388440

In [61]:
#使用numpy结构化数组实现